source/_posts/2016-09-25-arch下使用aria2下载资源.html
---
title: "arch下使用aria2下载资源"
date: 2016-09-25
layout: post
categories: 
- archlinux
tags: 
- archlinux
published: true
comments: 
---
<p>
linux世界中一直没有迅雷这样在windows中文用户中占有统治地位的下载工具，而像gnome和kde等桌面环境中自带的utorrent或ktorrent等下载工具，
本身下载速度不快，还又有着占用内存资源多，支持下载协议有限的缺点。对于追求简洁高效的系统的人来说，自然是难以接受的。
后来经过一番调研，终于找到了一款满意的下载工具&#x2013;aria2。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">aria2是什么？</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
aria2是一款轻量级的、支持多协议的和多个下载源的下载工具，支持HTTP/HTTPS，FTP，SFTP，BitTorrent以及Metalink等协议的下载。
具体介绍可参照<a href="https://aria2.github.io/">aria2官网</a>。
</p>

<p>
我想在这里说一下它的两个非常惊艳的优点：一个是轻量级：占用内存空间十分少，通常只占用4-9MB。
另一个优势就是支持RPC界面远程控制，可以很方便的对被配置为服务器的主机进行下载管理。
</p>

<p>
体会到了aria2的强大了之后，就来看看正确安装并配置aria2。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">aria2的安装及配置</h2>
<div class="outline-text-2" id="text-orgheadline6">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">安装aria2</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
由于aria2已经在archlinux的官方仓库中，所以安装十分方便，直接在命令行中使用pacman包管理工具进行安装即可:
</p>

<div class="org-src-container">

<pre class="src src-bash">$ sudo pacman -S aria2
</pre>
</div>

<p>
此时已经可以直接通过命令行运行aria2来进行下载，不过并不推荐。
因为相对于每次都通过命令行参数来对断点续传或者速度限制等功能进行说明的方法来说，有着更好的替代方案&#x2013;使用配置文件启动aria2服务，再通过web图形前端进行管理。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">配置aria2</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
配置文件主要用于你的RPC信息以及下载相关的速度，进度以及磁盘等信息的设置。具体可参考<a href="https://github.com/green-93-nope/myConfiguration/blob/master/aria2/aria2.conf">我的配置</a>。
该配置文件一般放在$HOME/.aria2/aria2.conf中。
</p>

<p>
除了这个配置文件之外你还需要创建一个session.lock文件，用来管理下载历史。
该文件所放置的位置和配置文件中的input-file和save-session对应即可。
</p>

<p>
配置完成后运行下面的命令，即可启动aria2到后台。-D表示运行程序到后台。
假如你不确定自己的配置是否正确，你可以命令后不加-D来观察输出是否正确。
</p>

<div class="org-src-container">

<pre class="src src-bash">$ aria2c --conf-path=&lt;PATH&gt; -D
</pre>
</div>

<p>
如果你和我一样厌烦了每次都要输入这一大堆命令你可以使用alias别名或者写一个简单的脚本来简化你的输入。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">图形前端</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
aria2本身并没有图形界面，不过可以通过一些开源的web图形前端来进行管理，也是非常方便的。
</p>

<p>
比较有名并且好用的图形前端主要有<a href="https://github.com/binux/yaaw">YAAW</a> 和<a href="https://github.com/ziahamza/webui-aria2">webui-aria2</a>。
我使用的是第二个。
</p>

<p>
这两款应用都已经在arch的AUR仓库中了，使用yaourt可以很方便的安装。比如：
</p>

<div class="org-src-container">

<pre class="src src-bash">$ sudo yaourt -S webui-aria2
</pre>
</div>

<p>
安装完成后在浏览器中打开<a href="http://ziahamza.github.io/webui-aria2/">管理页面</a> 即可进行管理，是不是特别简单。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">更多</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
aria2并不只是一个简单的下载工具，你还可以用它来：
</p>

<p>
1.下载百度云链接<a href="https://github.com/acgotaku/BaiduExporter">BaiduExporter</a>。
</p>

<p>
2.下载迅雷离线内容<a href="http://binux.github.io/ThunderLixianExporter/">ThunderLixianExporter</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">参考</h2>
<div class="outline-text-2" id="text-orgheadline7">
<p>
1.<a href="http://blog.binux.me/2012/12/aria2-examples/">aria2配置示例</a>
</p>

<p>
2.<a href="http://moflying.com/2016/06/05/%E5%A6%82%E4%BD%95%E4%BD%BF%E7%94%A8aria2%E5%8F%8Awebui-aria2%E4%B8%8B%E8%BD%BD%E7%99%BE%E5%BA%A6%E4%BA%91%E8%B5%84%E6%BA%90/">如何使用aria2及webui-aria2下载百度云资源</a>
</p>

<p>
3.<a href="https://wiki.archlinux.org/index.php/Aria2">aria2-archwiki</a>
</p>
</div>
</div>
